import { TAllBook } from "../types";

export const books: TAllBook = {
    id: 0,
    title: "Book title",
    author: "Book author",
    cover: "BookCover.png",
    price: 420,
    bookPages: 777,
    genre: ["Фантастика", "Приключения"],
    description: "Гарри взрослеет, и вместе с тем жить в Хогвартсе всё страшнее. Из тюрьмы для волшебников Азкабан сбежал опасный преступник - Сириус Блэк. Мир наполнился слухами, что он ищет и хочет убить одного тринадцатилетнего парня, совсем обычного на первый взгляд. Его имя - Гарри Поттер.",
    fragment: "Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент ",
    isFavorite: false,
    currentPage: 0,
    readPages: 0,
    readDate: new Date(),
    isRead: false
}