import { TShopBook } from "../types";


export const books: TShopBook[] = [
    {
        id: '0',
        title: "Гарри Поттер и узник Азкабана",
        author: "Джоан Роулинг",
        cover: "harryPotter3.jpg",
        price: 420,
    },
    {
        id: '1',
        title: "457 градусов по фаренгейту",
        author: "Рэй Брэдбери",
        cover: "451.png",
        price: 229,
    },
    {
        id: '3',
        title: "Мерцание серебра",
        author: "Джулиент Кемп",
        cover: "silver.jpg",
        price: 670,
    },
]
export const allBooks: any[] = [
    {
        id: 0,
        title: "Гарри Поттер и узник Азкабана",
        author: "Джоан Роулинг",
        cover: "harryPotter3.jpg",
        price: 420,
        bookPages: 777,
        genre: ["Фантастика", "Приключения"],
        description: "Гарри взрослеет, и вместе с тем жить в Хогвартсе всё страшнее. Из тюрьмы для волшебников Азкабан сбежал опасный преступник - Сириус Блэк. Мир наполнился слухами, что он ищет и хочет убить одного тринадцатилетнего парня, совсем обычного на первый взгляд. Его имя - Гарри Поттер.",
        fragment: "Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент ",
        isFavorite: false,
        currentPage: 0,
        readPages: 0,
        readDate: new Date(),
        isRead: false
    },
    {
        id: 1,
        title: "457 градусов по фаренгейту",
        author: "Рэй Брэдбери",
        cover: "451.png",
        price: 229,
        bookPages: 220,
        genre: ["Фантастика", "Приключения"],
        description: "Гарри взрослеет, и вместе с тем жить в Хогвартсе всё страшнее. Из тюрьмы для волшебников Азкабан сбежал опасный преступник - Сириус Блэк. Мир наполнился слухами, что он ищет и хочет убить одного тринадцатилетнего парня, совсем обычного на первый взгляд. Его имя - Гарри Поттер.",
        fragment: "Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент ",
        isFavorite: false,
        currentPage: 0,
        readPages: 0,
        readDate: new Date(),
        isRead: false
    },
    {
        id: 3,
        title: "Мерцание серебра",
        author: "Джулиент Кемп",
        cover: "silver.jpg",
        price: 670,
        bookPages: 777,
        genre: ["Фантастика", "Приключения"],
        description: "Гарри взрослеет, и вместе с тем жить в Хогвартсе всё страшнее. Из тюрьмы для волшебников Азкабан сбежал опасный преступник - Сириус Блэк. Мир наполнился слухами, что он ищет и хочет убить одного тринадцатилетнего парня, совсем обычного на первый взгляд. Его имя - Гарри Поттер.",
        fragment: "Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент Это типа фрагмент ",
        isFavorite: false,
        currentPage: 0,
        readPages: 0,
        readDate: new Date(),
        isRead: false
    },
]